app/controllers/home_controller.rb

  def inicio
    @posts = Post.all
    @post = Post.last
    @navbars = Navbar.all
    @products = Product.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "navbars".* FROM "navbars"
SELECT "products".* FROM "products"