app/controllers/navbars_controller.rb

  def index
    @navbars = Navbar.all
---
SELECT "navbars".* FROM "navbars"

  def create
    @navbar = Navbar.new(navbar_params)

    respond_to do |format|
      if @navbar.save
---
INSERT INTO "navbars" ("label", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["label", "Prueba"], ["url", "#"], ["created_at", "2022-10-27 00:32:02.493713"], ["updated_at", "2022-10-27 00:32:02.493713"]]

  def update
    respond_to do |format|
      if @navbar.update(navbar_params)
---
UPDATE "navbars" SET "label" = ?, "updated_at" = ? WHERE "navbars"."id" = ?  [["label", "Productos"], ["updated_at", "2022-10-27 00:31:39.405068"], ["id", 3]]

    def set_navbar
      @navbar = Navbar.find(params[:id])
---
SELECT "navbars".* FROM "navbars" WHERE "navbars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]