app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("image", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["image", nil], ["title", "Esto es un nuevo post"], ["content", nil], ["created_at", "2022-10-26 15:44:21.345855"], ["updated_at", "2022-10-26 15:44:21.345855"]]