app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("image", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["image", nil], ["title", "Esto es una pera"], ["description", nil], ["created_at", "2022-10-27 01:28:36.086299"], ["updated_at", "2022-10-27 01:28:36.086299"]]